// src/data/contentIndex.js
const contentIndex = [
  {
    title: "Gallery",
    content: "This is the gallery section with various images and videos.",
    route: "/gallery",
  },
  //   {
  //     title: "Kids Stories",
  //     content: "Stories for kids available in the knowledge hub.",
  //     route: "./Knowledge Hub/Kids Corner/Stories/KidsStories",
  //   },
  {
    id: 1,
    title: "مباہلہ",
    content: `

(زہرا کالج میں سب کے درمیان مٹھائی بانٹتے ہوئے اور خوشی سے)

زہرا: سب مٹھائی کھائیں........ اج بہت ہی خوشی کا دن ہے۔۔۔۔۔ اؤ اؤ ثانیہ تم بھی لو ۔۔۔۔۔۔اج تمام ادیان پر دین اسلام کے غلبے کا دن ہے۔۔۔۔۔۔۔۔۔  اج اہل بیت کی سب سے بڑی فضیلت کے دن ہے۔۔۔۔۔۔۔۔۔ اج صرف سچوں کا دن ہے۔۔۔۔۔۔۔
زینب، لینا کو بھی بلاؤ اس سے بھی دو مٹھائی۔۔۔۔۔

زینب: زہرا کیا کر رہی ہو ......وہ تو کرسچن ہے
زہرا: تو کیا ہوا وہ ہمارے نبی حضرت عیسی کو ماننے والی ہے اور یہ  بات ہماری اور ان کے درمیان بالکل same ہے.
زینب ; لینا hello 
لینا : Hy ,how are you
زینب: I am good.please take some sweet
لینا: لیکن یہ کس لیے ہے؟ زہرا کی منگنی ہو تو نہیں ہو گئی( مذاق کرتے ہوئے)
زہرا :نہیں لینا...... اج ہمارے دین کا بہت بڑا event ہے. تو سوچا مٹھائی بانٹ لوں....
لینا: کیسا event؟
زہرا: 1400 سال پہلے ہمارے نبی نے جب دین اسلام کو کامیابی سے پھیلا دیا اور زیادہ تر مشرکین مکہ مسلمان ہو گئے تو ہمارے نبی نے ایک خط اس زمانے کے عیسائی pop کو بھیجا کہ وہ بھی مسلمان ہو جائیں یا جزیادیں.... جب وہ مدینہ ائے اور رسول خدا صلی اللہ علیہ والہ وسلم سے ملاقات کی اور مناظرہ کیا تو اس مناظرے میں جب وہ ہار گئے تو اللہ نے اپنے نبی کو وحی بھیجی کہ ان سے مباہلہ کرو.....
لینا: مباہلہ!!!!!!! مباہلہ کیا کوئی جنگ تھی؟
زینب: مباہلے کا مطلب ہے کہ سب دلیلیں دینے کے بعد بھی اگر فیصلہ نہ ہو سکے کہ کون سچا ہے اور کون جھوٹا، تو پھر اللہ سے دونوں گروپ ایک دوسرے کے لیے عذاب مانگتے ہیں اور جس پر عذاب نازل ہو وہ جھوٹا ہوتا ہے۔
جینیفر:  لینا چلو یہاں سے۔۔۔۔۔ یہ تم کن لوگوں کی باتیں سن رہی ہو۔۔۔۔۔ عیسائیت ھی اصلی دین ہے اور جب حضرت عیسی اللہ کے بیٹے ہیں تو ان کے نبی کی کیا حیثیت رہ جاتی ہے۔۔۔۔۔۔
زہرا :جینی، عیسی اللہ کے بیٹے کیسے ہو سکتے ہیں وہ تو صرف اللہ کے بندے ہیں.
جینیفر: کیونکہ وه بغیر باپ کے پیدا ہوئے ہیں اور یہ کوالٹی تمہارے نبی کے پاس نہیں ہے......
زہرا :اگر بغیر باپ کے پیدا ہونا فضیلت ہے تو پھر حضرت ادم اور حضرت حوا تو باپ کیا بغیر ماں کے پیدا ہوئے ہیں لیکن ان کو تو کوئی خدا کا بیٹا نہیں کہتا.......
لینا :نہیں نہیں جینی نے غلط کہا وہ خدا کے بیٹے نہیں ہیں بلکہ وہ تو خود خدا کا ایک حصہ ہے .......ہماری انجیل میں بھی یہی ہے کہ وہ خدا ہیں...... انہوں نے ماں کی گود میں کلام کیا....... وہ مردوں کو زندہ کرتے تھے......
زینب: اگر ماں کی گود میں کلام کرنا خدا ہونے کی دلیل ہے تو حضرت یوسف کی گواہی دینے والا بچہ بھی خدا ہوا .......اور اگر مردوں کو زندہ کرنا خدا ہونے کی دلیل ہے تو پھر حضرت موسی اور حضرت ابراہیم بھی خدا ہیں کیونکہ حضرت موسی نے مقتول کو اور حضرت ابراہیم نے چار پرندوں کو زندہ کیا......!!!!
زہرا: یہ کیسا خدا ہے جو اپنی حفاظت نہ کر سکا اور لوگوں نے ان کو صلیب پر چڑھا دیا ؟.....اور پھر ان کو دفن بھی کیا. یہ کیسا خدا ہے جو نمازیں بھی پڑھتا ہے روزے بھی رکھتا ہے جبکہ خدا عبادت نہیں کرتا بلکہ اس کی عبادت کی جاتی ہے۔۔۔۔۔؟
یہ کیسا خدا ہے جو کھاتا ہے پیتا ہے سوتا ہے اور جاگتا ہے؟
یہ تو ہم بالکل انسانوں جیسا ہے جب کہ ہم جانتے ہیں کہ خدا انسانوں جیسا نہیں ہو سکتا۔
جینیفر :میرا توسرا چکرا رہا ہے تم لوگوں کی باتیں سن کر.....
لینا :میں نے تو کبھی ایسا سوچا ہی نہیں تھا...... تم صحیح کہہ رہی ہو زہرا..... اچھا پھر بتاؤ عذاب کس پر نازل ہوا؟
زہرا :کسی پر بھی نہیں.......
جینیفر:  یہ کیا بات ہوئی کہ کسی پر بھی نہیں،،،،
زہرا :وہ اس لیے کہ جب رسول خدا اپنی بیٹی نواسے اور بھائی کے ساتھ میدان میں ائے تو عیسائیوں کا سب سے بڑا pop ان کے نورانی چہرے دیکھ کر سمجھ گیا کہ یہ لوگ عام انسان نہیں ہیں یہ کوئی نورانی ہستیاں ہیں... اس نے اسمان پر عذاب کی اثار بھی دیکھ لیے تھے.... اس نے کہا اگر یہ لوگ بددعا کر دیں تو ہم عیسائیوں میں کوئی بھی باقی نہیں رہے گا ...عیسائیت ختم ہو جائے گی. ہمیں محمد سے بات کر کے ان کو جزیہ دینا ہوگا. تب ان لوگوں نے اپنی شکست تسلیم کی اور یوں خدا نے اہل بیت کے ذریعے اسلام کو عیسائیت پر بغیر جنگ کے فتح نصیب کی.
زینب: اور لینا ,جینی ,تم لوگ جانتے ہو کہ ہمارے حضرت عیسی جب واپس ائیں گے تو بیت المقدس میں ہمارے اخری امام, امام مہدی کے پیچھے نماز پڑھیں گے اور جب عیسائی یہ منظر دیکھیں گے تو وہ بھی سب مسلمان ہو جائیں گے.
لینا: میں نے تمہاری باتیں سنی ہیں اور میرے دل کو سکون بھی ملا ہے. میں خود اب اس بارے میں ریسرچ کروں گی تاکہ زیادہ اسلام کو سمجھ سکوں.
زہرا :میں تمہیں ایک link بھیجوں گی اس میں ان لوگوں کے انٹرویوز ہیں جو لوگ عیسائی تھے اور مسلمان ہوئے .وہ تمہاری ریسرچ میں بہت help کرے گا.
لینا: Thank you very much zahra
It was a very good day for me.
Your welcome dear good by:.زهرا
    `,
  },
  {
    id: 2,
    title: "ولایت فقیه",
    content: `
    
(عاصمہ کمرے میں بیٹھی فون استعمال کر رہی ہے اور اتنی دیر میں بتول اور سدرہ کمرے میں داخل ہوتی ہیں)
سدرہ: السلام علیکم بہن کیسی ہیں اپ؟
عاصمہ: علیکم السلام ۔۔۔۔۔کیسی ہو بہنوں۔۔۔۔ بہت شکریہ اپ لوگوں کے آنے کا۔۔۔۔۔۔۔ تشریف رکھیے
سدرہ:  بہت شکریہ۔ بہن بتاؤ اب تمہارے بیٹے کی طبیعت کیسی ہے؟ ہم تو بہت پریشان ہو گئے تھے.
عاصمه : شکر ہے اللہ کا ....اب تو میرا بیٹا بہت بہتر ہے.
بتول:  کس جگہ سے علاج کروایا هے؟
عاصمہ: یہاں ہی پر ایک بہت ہی بہترین سپیشلسٹ سے اس کا علاج کروایا ہے۔ ۔۔۔۔بہت ہی اچھا ڈاکٹر ہے ۔۔۔۔۔۔۔۔امریکہ سے پڑھ کر ایا ہے اور تقریبا 36 سال کا تجربہ ہے۔۔۔۔۔ بہت ہی بہترین علاج کیا ہے۔۔۔۔ تھوڑا سا مہنگا تھا لیکن بچے کی صحت کے اگے تو کچھ بھی نہیں۔۔۔۔ل
سدرہ: عاصمہ بہن کتنا خرچہ ہو گیا ہوگا؟
عاصمہ:خرچے کی کیا بات ہے انسان کی صحت بہت ضروری ہے..... پیسہ تو آنی جانی چیز ہے .....صحت اگئی تو دوبارہ بھی پیسہ آ جائے گا۔۔۔
سدرہ:  نہیں بہن میں تو یہ کہہ رہی تھی کہ اب اس تھوڑے سے بخار کے لیے انسان کہاں سپیشلسٹ کے پاس جاتا رہے۔۔۔۔۔۔ یہی کوئی حکیم سے کوئی دوائی لے لیتی تو بہت جلد آرام آ جاتا۔۔۔۔۔۔ نہ ہی خرچہ ہوتا اور نہ ہی یہ اتنی بھاگ دوڑ کرنی پڑتی ہے۔۔۔۔۔۔۔
بتول:  سدرہ یہ کیسی بات کر رہی ہو !!!!انسان کی جسمانی صحت بہت ضروری ہے اور اس کے لیے اچھے ڈاکٹر کی بھی ضرورت ہوتی ہے۔۔۔۔
(عاصمہ کا فون بجتا ہے)
عاصمه: (کال سنتے ہوئے)ہاں زینب بتاؤ کیا بات ہے .......اچھا ......اچها...... تو ایسا کرو کہ ابهی روزه نہ رکھواؤ ......پیپر دلوا لو...... اتنی شدید گرمی اوپر سے اتنے بڑے امتحان..... فائنل exam ہے.... یہ تو موقع پھر نہیں ائے گا روزہ تو قضا بھی کیا جا سکتا ہے. چلو ٹھیک ہے اپنا خیال رکھو خدا حافظ........
بتول :عاصمہ یہ تم سے کس سے بات کر رہی تھی؟
عاصمہ: بہن کی بیٹی کا فائنل پیپر ہے سیکنڈ ایئر کا۔۔۔۔ پوچھ رہی تھی کہ بیٹی کو روزہ رکھواؤں یا نہیں؟ میں نے بھی کہا نہ رکھواو۔۔۔۔ بعد میں رکھ لے گی ۔۔۔۔۔ابھی تو بڑی عمر پڑی ہے۔۔۔۔ exam روز روز تو نہیں ہوگا....
بتول:  یہ تم نے کیا کیا ......کیوں غلط رہنمائی کی ہے......
عاصمه: ہائے ہائے بہن کیا ہو گیا میں نے کیا کر دیا ہے!!!!!
بتول:  بہن کیا تم نے کسی عالم دین کی توضیح المسائل دے کر فتوی دیا ہے یا خود سے کہہ دیا ہے؟

عاصمہ: اس میں فتوی دیکھنے کی کیا ضرورت تھی ۔ بیچاری مجبور ہے۔
بتول : خدا ہمیں ہدایت دے۔۔۔۔۔ یہ دین بھی بڑا مظلوم ہے ۔۔۔۔جس کا جب دل چاہتا ہے  فتوی دیتا رہتا ہے۔۔۔۔۔۔ جسم اگر بیمار ہو جائے تو کسی نکڑ کے حکیم سے دوا نہیں لیں گے بلکہ سپیشلسٹ کے پاس جائیں گے۔۔۔۔۔۔ دیکھیں گے کہ باہر کا پڑا ہو بہترین تجربہ بھی رکھتا ہوں علاج بھی صحیح کرے۔۔۔۔۔۔۔ لیکن جب عقیدہ اور عمل کی بات ائے تو سب ہی فتوے دینے لگ جاتے ہیں۔۔۔۔۔۔۔
سدرہ : بتول باجی اپ کی بات بالکل درست ہے لیکن اب اپ ہی بتائیں کہ ہم اس وقت کہ جب ہمارے امام ہماری نظروں سے غائب ہیں کس کو follow کریں؟..
بتول:  دیکھو عاصمہ اور سدرہ بہن .....خدا نے ہمیں قران میں راہ حل دیا ہے .حضرت موسی جب 40 دن کے لیے اپنی قوم سے دور گئے تو انہوں نے اپنی امت کو تنہا نہیں چھوڑا بلکہ ان کی ہدایت کے لیے اپنے بھائی ہارون کو امت کا لیڈر بنایا. اسی طرح ہمارے امام زمانہ جب غیبت میں گئے ہیں تو انہوں نے بھی ہمیں بے یارو مددگار نہیں چھوڑا بلکہ ہمیں علماء اور مجتہدین کی طرف رہنمائی کی ہے.
سدرہ: لیکن ایک بات ہے کہ ہارون تو نبی تھے اور معصوم بھی تھے تو ہم کیوں غیر معصوم کی پیروی کریں؟
بتول :بہت ہی اچھا سوال ہے۔۔۔۔۔۔ اب مجھے یہ بتاؤ کہ امام زماں جب غیبت صغری میں جا رہے تھے تو امام نے جن چار افراد کو اپنے بعد نائب بنایا وہ معصوم تھے۔؟
سدرہ:  نہیں وہ معصوم نہیں تھے
بتول : تو اس کا مطلب ہے کہ امام ہمیں تیار کر رہے تھے کہ میری غیبت میں اپ نے ان لوگوں کی پیروی کرنی ہے جو معصوم تو نہیں ہے لیکن وہ اہل علم ، اہل تقوی اور اہل معرفت افراد ہیں۔
 اب میں اپ کو ایک اور مثال دیتی ہوں۔
 امام حسین علیہ السلام نے اہل کوفہ کے خطوط کے جواب میں مسلم بن عقیل کے بارے میں فرمایا تھا کہ "میں تمہاری طرف اپنا بھائی اپنا چچا زاد اور اپنی اہل بیت میں سب سے قابل اعتماد شخص کو بھیج رہا ہوں" امام حسین علیہ السلام نے مسلم بن عقیل کو اپنا نمائندہ بنایا اور ان کے ہاتھ پر بیعت گویا امام حسین علیہ السلام کے ہاتھ پر بیعت تھی.
اسی طرح سے ہمارے وقت کے امام نے، اسحاق بن یعقوب کے خط کے جواب میں لکھا تھا کہ "جب بھی تمہیں مشکل حالات پیش ائیں تو تم ہماری روایات کو بیان کرنے والے فقہاء کی طرف رجوع کرنا کیونکہ وہ تم پر ہماری جانب سے حجت ہے اور ہم اللہ کی جانب سے ان پر حجت ہیں "
اس طرح سے  امام واضح طور پر بتا رہے ہیں کہ فقہا امام زماں کی غیبت کبری میں ہم پر حجت ہیں اور ان کی اطاعت ایسی ہے کہ گویا ہم امام کی اطاعت کر رہے ہیں
عاصمہ: ماشاءاللہ بتول بہن۔۔۔ اپ نے تو میرے لیے بہت کچھ واضح کر دیا ۔۔۔۔۔مجھے بھی ایک حدیث یاد ارہی ہے کہ رسول خدا ہی نے فرمایا تھا ۔۔۔"علماء انبیاء کے وارث ہیں"
جس طرح سے انبیاء کے وارث ہمارے ائمہ طاہرین علیہ السلام ہیں اسی طرح سے ائمہ کے بھی وارث ہیں اور وہ اہل تقوی اور اہل معرفت مجتہدین ہیں.
سدرہ: بالکل ہم جب عید غدیر اتی ہے تو ہم سب سے بڑی دلیل یہی دیتے ہیں کہ رسول خدا صلی اللہ علیہ والہ وسلم نے اپنی وفات سے پہلے، امت کے لیے  جانشین چھوڑ کر گئے۔۔۔۔ یہ کیسے ممکن ہے کہ رسول خدا اس دنیا سے جا رہے ہوں لیکن اپنی امت کے لیے کسی رہنما کو نہ چھوڑ کے جائیں؟۔۔۔۔۔ تو یہی بات امام زماں کے لیے بھی ہے کہ جب امام غیبت کبری میں جا رہے ہیں تو یہ کیسے ممکن ہے کہ امام اپنی امت کو بے یار و مددگار چھوڑ کے جائیں اور لوگوں کو کوئی رہنمائی نہ دے کر جائیں۔۔۔۔۔
بتول:  ایسے ہی ہے ۔۔۔۔۔یہی علماء ہیں کہ جن کے کلام اور جن کی رہنمائی میں انقلابات وجود میں اتے ہیں.... کیا تم نے نہیں سنا ہے حدیث میں ہے کہ "علماء کا قلم شہداء کی خون سے افضل ہے" معلوم ہے کیوں؟ کیونکہ شہدا اگر عشق شہادت سے سرشار ہیں اور ان کا مقصد زندہ ہے تو وہ بھی علماء کی ہدایت اور ان کے علم کے نور کی وجہ سے ہے ۔جس طرح سے 35 سال پہلے امام خمینی نے طاغوت کے مقابلے میں انقلاب لائے اور شہدا نے اپنی جانوں کے ذریعے اس انقلاب کو کامیاب کیا۔۔۔ اج 35 سال کے بعد بھی ایسے شیعہ علماء پوری دنیا میں ہیں جو شیعوں کے انقلاب کو زندہ رکھے ہوئے ہیں۔۔۔ جیسے ایران میں رہبر معظم ۔۔۔۔۔عراق میں ایت اللہ سیستانی ۔۔۔۔۔لبنان میں حسن نصر اللہ۔۔۔۔ یہ وہ عظیم لیڈرز ہیں جن کی لیڈرشپ میں دشمن اج خوفزدہ اور شکست کھا رہا ہے ۔۔۔۔اج اگر شیعت کامیاب ہے اور لوگ مذہب تشیع کی طرف آرہے ہیں تو اس میں ایک اہم کردار انہی شیعہ علماء کی لیڈرشپ کا ہے ۔۔۔۔ہمیں چاہیے کہ ہم ان کی لیڈرشپ میں امام زمانہ کے ظہور میں مدد کریں تاکہ ہم سب امام کے انصا میں سے شمار ہو سکیں۔
        `,
  },

  // content: "Various articles on different topics.",
  // route: "./Knowledge Hub/Makala/ArticlesPage",
  {
    title: "شیعہ کون ہیں؟",
    content: `اس مضمون میں شیعہ کے بنیادی اصولوں، مذہبی عقائد، اور تاریخی پس منظر پر غور کیا جائے گا۔

مضامین:
تعریف و تاریخی پس منظر: شیعہ کی تعریف اور اس کی بنیادیں، اسلامی تاریخ میں اس کا ابتدائی مظاہرہ۔

عقائد و اصول: شیعہ عقائد کے مخصوص پہلو، مثلاً عقیدہ امامت اور عدالت۔

شیعہ فقہی تشریح: شیعہ فقہی مزہبی احکام اور ان کی مواقف، مثلاً نماز، روزہ، زکوٰة، خم وغیرہ۔

شیعہ کا موقعہ اور عصر حاضر: شیعہ فکری، معاشرتی اور سیاسی مقامات کے بارے میں بحث۔`,
  },
  {
    title: "تقلید کیوں ضروری ہے؟",
    content: `مقالے میں تقلید کے مفہوم، اہمیت، اور اس کے مختلف فقہی مذاہب میں اس کی تشریح کی جائے گی۔

مضامین:
تقلید کی تعریف اور اصول: تقلید کے مفہوم، اس کے اصول، اور فقہی احکام پر اس کا اثر۔

تقلید کے اہمیت: تقلید کے فقہی، معاشرتی، اور دینی میں اہمیت، مثلاً مسلمانوں کے لیے دینی مسائل کا حل، اجتماعی امور کی تنظیم، اور اخلاقیات۔

مختلف فقہی مذاہب میں تقلید: ہندس، مالکی، شافعی، حنفی فقہ کے بین الاقوامی اماموں کی تقلید کے مفہوم، مفاسد، وممکنات۔`,
  },

  {
    title: "Majalis",
    content: "Majalis content in the knowledge hub.",
    route: "./Knowledge Hub/Majalis/Majalis",
  },
];

export default contentIndex;
